tap "homebrew/bundle"


brew "cask"
brew "gh"
brew "jupyterlab"
brew "mas"
brew "python"
brew "ripgrep"
brew "terraform"
brew "tree"


cask "appcleaner"
cask "arc"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "imageoptim"
cask "logi-options-plus"
cask "maccy"
cask "notion"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission"
cask "upscayl"
cask "visual-studio-code"
cask "vlc"
cask "warp"

# Optional
# cask "balenaetcher"
# cask "box-drive"
# cask "disk-drill"
# cask "firefox"
# cask "cloudflare-warp"
# cask "plex-media-server"
# cask "signal"


mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Boop", id: 1518425043
mas "Duplicate File Finder", id: 1032755628
mas "Hand Mirror", id: 1502839586
mas "Hidden Bar", id: 1452453066
mas "HP Smart", id: 639968404
mas "Microsoft Outlook", id: 985367838
mas "Parcel", id: 639968404
mas "Tailscale", id: 1475387142



# vscode "github.vscode-github-actions"
# vscode "golang.go"
# vscode "hashicorp.hcl"
# vscode "hashicorp.terraform"
# vscode "janisdd.vscode-edit-csv"
# vscode "l13rary.l13-diff"
# vscode "marcostazi.vs-code-vagrantfile"
# vscode "mechatroner.rainbow-csv"
# vscode "mikestead.dotenv"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode.powershell"
# vscode "pkief.material-icon-theme"
# vscode "redhat.ansible"
# vscode "redhat.vscode-yaml"
# vscode "zhuangtongfa.material-theme"
